Управление_торговлей.ПБТ/src/Documents/вт_ПередачаСырьяВПереработку/вт_ПередачаСырьяВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вт_ПередачаСырьяВПереработку</name>
  <registerRecords>AccumulationRegister.вт_ДавальческоеСырьеПереданное</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаПартий</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаПартий</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Documents/вт_ПередачаСырьяВПереработку/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	//МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);

		Элементы.Партнер.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов");
		
		Если Объект.Ссылка.Пустая() ТОгда
			 Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
КонецПроцедуры

 &НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПриИзмененииКонтрагентаСервер();
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКонтрагентаСервер()
	Объект.Партнер = Объект.Контрагент.Партнер;	
КонецПроцедуры	


&НаКлиенте
Процедура УказатьСерии(Команда)
	
	ОткрытьПодборСерийСырья();
	 
	//ПараметрыУказанияСерий = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	//ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры = Истина;
	//ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.вт_ПередачаСырьяВПереработку";
	//ПараметрыУказанияСерий.ИмяТЧТовары = "Товары";
	//
	//НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтаФорма.Объект, ПараметрыУказанияСерий);
	//
	//мМассив = Новый Массив;
	//мМассив.Добавить("КлючСвязиСтроки");
	//ПараметрыУказанияСерий.ПоляСвязи = мМассив;	
	//
	//Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма, ПараметрыУказанияСерий, Текст, ТекущиеДанные)Тогда
	//	
	//	Если ТекущиеДанные = Неопределено Тогда
	//		ТекущиеДанныеИдентификатор = Элементы.ТаблицаСырье.ТекущиеДанные.ПолучитьИдентификатор();
	//	Иначе
	//		ТекущиеДанныеИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
	//	КонецЕсли;
	//	
	//	ПараметрыФормыУказанияСерий = НоменклатураСервер.ПараметрыФормыУказанияСерий(ЭтаФорма,,ТекущиеДанныеИдентификатор);		
	//	
	//	ЗначениеВозврата = Неопределено;
	//	
	//	ОткрытьФорму(ПараметрыФормыУказанияСерий.ИмяФормы, ПараметрыФормыУказанияСерий, ЭтаФорма,,,,
	//	
	//							Новый ОписаниеОповещения("ОткрытьПодборСерийСырьяЗавершение", ЭтотОбъект,
	//							
	//							Новый Структура("ПараметрыФормыУказанияСерий", ПараметрыФормыУказанияСерий)), 
	//							
	//							РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//	
	//КонецЕсли;
	//
	//
	////ОткрытьПодборСерийСырья(,,ПараметрыФормыУказанияСерий);
	
	
	
КонецПроцедуры


&НаСервере
Процедура ОткрытьПодборСерийСырья(Текст = "", ТекущиеДанные = Неопределено)
	
	//УказатьСерииНаСервере
	
	ПараметрыУказанияСерий = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры = Истина;
	ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.вт_ПередачаСырьяВПереработку";
	ПараметрыУказанияСерий.ИмяТЧТовары = "Товары";
	//ПараметрыУказанияСерий.ИмяТЧСерии = "Серии";
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтаФорма.Объект, ПараметрыУказанияСерий);
	
КонецПроцедуры
